{
    "daisy": "Tên khoa học: Bellis perennis.\nNguồn gốc: Châu Âu và Bắc Mỹ.\nĐặc điểm: Hoa nhỏ, màu trắng với tâm vàng, thân ngắn, lá mọc sát đất.\nÝ nghĩa biểu tượng: Tượng trưng cho sự ngây thơ, tinh khiết và khởi đầu mới.\nỨng dụng công dụng: Thường dùng trong y học cổ truyền để chữa lành vết thương và làm dịu các vấn đề về da.",
    "dandelion": "Tên khoa học: Taraxacum officinale.\nNguồn gốc: Châu Âu và Châu Á.\nĐặc điểm: Hoa màu vàng sáng, lá răng cưa, quả có hình cầu với các hạt mịn dễ bay theo gió.\nÝ nghĩa biểu tượng: Biểu tượng của sự kiên cường, hy vọng và ước mơ.\nỨng dụng công dụng: Toàn bộ cây có thể ăn được, dùng trong salad, trà thảo dược và làm thuốc lợi tiểu.",
    "lily": "Tên khoa học: Lilium spp.\nNguồn gốc: Bắc bán cầu, đặc biệt là Châu Á và Châu Âu.\nĐặc điểm: Hoa lớn, hình chuông hoặc loa kèn, có mùi thơm đặc trưng, màu sắc đa dạng.\nÝ nghĩa biểu tượng: Tượng trưng cho sự tinh khiết, tái sinh và sự cao quý.\nỨng dụng công dụng: Dùng trong y học cổ truyền, làm nước hoa và trang trí trong các dịp lễ.", 
    "orchid": "Tên khoa học: Orchidaceae.\nNguồn gốc: Phân bố rộng rãi trên toàn thế giới, đặc biệt là các vùng nhiệt đới.\nĐặc điểm: Hoa đa dạng về hình dạng và màu sắc, thường có cấu trúc phức tạp để thu hút côn trùng thụ phấn.\nÝ nghĩa biểu tượng: Biểu tượng của sự sang trọng, tình yêu và vẻ đẹp hiếm có.\nỨng dụng công dụng: Dùng làm thuốc trong y học cổ truyền, trang trí và sản xuất tinh dầu.",
    "rose": "Tên khoa học: Rosa spp.\nNguồn gốc: Có nguồn gốc từ châu Á, châu Âu và Bắc Mỹ.\nĐặc điểm: Hoa có nhiều lớp cánh, màu sắc đa dạng từ đỏ, trắng, vàng đến hồng.\nÝ nghĩa biểu tượng: Tượng trưng cho tình yêu, sự lãng mạn và sắc đẹp.\nỨng dụng công dụng: Chiết xuất tinh dầu và nước hoa hồng, làm mứt, trà, và trang trí.",
    "sunflower": "Tên khoa học: Helianthus annuus.\nNguồn gốc: Có nguồn gốc từ Bắc Mỹ.\nĐặc điểm: Hoa lớn, màu vàng tươi với tâm nâu hoặc đen, thân cao và lá to.\nÝ nghĩa biểu tượng: Biểu tượng của sự vui vẻ, năng lượng và sự ngưỡng mộ.\nỨng dụng công dụng: Hạt hướng dương dùng làm thực phẩm, dầu hướng dương trong nấu ăn và làm nhiên liệu sinh học.",
    "tulip": "Tên khoa học: Tulipa spp.\nNguồn gốc: Có nguồn gốc từ Trung Á và Thổ Nhĩ Kỳ.\nĐặc điểm: Hoa hình cốc, màu sắc đa dạng từ đỏ, vàng, hồng đến tím.\nÝ nghĩa biểu tượng: Tượng trưng cho sự hoàn hảo, tình yêu vĩnh cửu và sự giàu có.\nỨng dụng công dụng: Chủ yếu dùng làm hoa trang trí, biểu tượng văn hóa và trong nghệ thuật."
}